app/controllers/api/sessions_controller.rb

  def create
    if (User.find_by(email: params[:user][:email]))
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "kentokento@kento.com"], ["LIMIT", 1]]